# Examen Final: 420-DK1-GC
Durée : 3 heures

# Lecture du fichier

L'ensemble de données contient des données sur les clients d'une société de cartes de crédit et est utilisé pour prédire le taux de désabonnement. Voici les variables qu'il contient :

`customer_id / identifiant_client:` Un identifiant unique pour chaque client.  
`age / âge:` L'âge du client.  
`gender/ sexe:` Le sexe du client.  
`education_level / niveau_éducation:` Le niveau d'éducation le plus élevé atteint par le client.  
`marital_status/ état_civil:` L'état civil du client (par exemple, célibataire, marié, divorcé).  
`estimated_income / revenu_estimé:` Le revenu annuel estimé du client.  
`months_on_book / mois_dans_les_registres:` Le nombre de mois pendant lesquels le client a été enregistré auprès de l'entreprise.  
`credit_limit / limite_de_crédit:` Le montant maximum de crédit accordé au client.  
`total_trans_amount / montant_total_des_transactions:` Le montant total des transactions effectuées par le client sur une période spécifiée.  
`total_trans_count / nombre_total_des_transactions:` Le nombre total de transactions effectuées par le client sur une période spécifiée.  
`churn / desabonnement:` Un indicateur binaire de savoir si le client a arrêté d'utiliser le service.  
`year / année:` L'année où les données ont été enregistrées.

**Question 1:** visualiser le fichier *churn_predit_over_time.csv* par un dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('churn_predict_over_time.csv',header=0)
df

,customer_id,age,gender,education_level,marital_status,estimated_income,months_on_book,credit_limit,total_trans_amount,total_trans_count,churn,year
0,768805383,45,M,High School,Married,69000,39,12691.0,1144,42,0,2018
1,818770008,49,F,Graduate,Single,24000,44,8256.0,1291,33,0,2018
2,713982108,51,M,Graduate,Married,93000,36,3418.0,1887,20,0,2018
3,769911858,40,F,High School,Unknown,37000,34,3313.0,1171,20,0,2018
4,709106358,40,M,Uneducated,Married,65000,21,4716.0,816,28,0,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
81010,788814783,39,M,Uneducated,Single,60000,22,9204.0,1820,58,0,2022
81011,711711483,61,M,High School,Married,92000,50,2800.0,1433,40,0,2022
81012,713269533,42,M,College,Single,118000,36,9959.0,8847,85,1,2022
81013,719070108,44,M,Graduate,Married,115000,35,34516.0,1729,52,0,2022
81014,758753283,52,M,Doctorate,Married,121000,45,34516.0,7341,71,1,2022

Procédant par un analyse rapide du jeud de donnée

**Question 2:** Valider si l'ensemble des données contient des valeurs nulles

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81015 entries, 0 to 81014
Data columns (total 12 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   identifiant_client              81015 non-null  int64
 1   age                             81015 non-null  int64
 2   sexe                            81015 non-null  object
 3   niveau_education                81015 non-null  object
 4   etat_civil                      81015 non-null  object
 5   revenu_estime                   81015 non-null  int64
 6   mois_dans_les_registres         81015 non-null  int64
 7   limite_credit                   81015 non-null  float64
 8   montant_total_des_transactions  81015 non-null  int64
 9   nombre_total_des_transactions   81015 non-null  int64
 10  desabonnement                   81015 non-null  int64
 11  année                           81015 non-null  int64
dtypes: float64(1), int64(8), object(3)
memory usage: 7.4+ MB

**Question 3:** Changer l'entête du dataframe avec une entête en français

In [23]:
header =  ['identifiant_client','age', 'sexe', 'niveau_education', 'etat_civil', 'revenu_estime'
          , 'mois_dans_les_registres', 'limite_credit', 'montant_total_des_transactions' 
          , 'nombre_total_des_transactions', 'desabonnement', 'année']

In [24]:
df.columns = header
df

,identifiant_client,age,sexe,niveau_education,etat_civil,revenu_estime,mois_dans_les_registres,limite_credit,montant_total_des_transactions,nombre_total_des_transactions,desabonnement,année
0,768805383,45,M,High School,Married,69000,39,12691.0,1144,42,0,2018
1,818770008,49,F,Graduate,Single,24000,44,8256.0,1291,33,0,2018
2,713982108,51,M,Graduate,Married,93000,36,3418.0,1887,20,0,2018
3,769911858,40,F,High School,Unknown,37000,34,3313.0,1171,20,0,2018
4,709106358,40,M,Uneducated,Married,65000,21,4716.0,816,28,0,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
81010,788814783,39,M,Uneducated,Single,60000,22,9204.0,1820,58,0,2022
81011,711711483,61,M,High School,Married,92000,50,2800.0,1433,40,0,2022
81012,713269533,42,M,College,Single,118000,36,9959.0,8847,85,1,2022
81013,719070108,44,M,Graduate,Married,115000,35,34516.0,1729,52,0,2022
81014,758753283,52,M,Doctorate,Married,121000,45,34516.0,7341,71,1,2022

**Question 4:** lister les valeurs distinctes pour chacune des colonnes `sexe`, `niveau_education` et `etat_civil`

In [19]:
 df['sexe'].unique()

array(['M', 'F'], dtype=object)

In [20]:
df.niveau_education.unique()

array(['High School', 'Graduate', 'Uneducated', 'Post-Graduate',
       'College', 'Doctorate'], dtype=object)

In [21]:
df.etat_civil.unique()

array(['Married', 'Single', 'Unknown', 'Divorced'], dtype=object)

**Question 5:** quelle est la rangé de la colonne annee

In [28]:
print(df['année'].min(), '-', df['année'].max())

2018 - 2022

**Question 6:** modifier la colonne `sexe` en changant `M` par `Male` et `F` par `Femelle`

In [30]:
df['sexe'] = df['sexe'].replace({'M': 'Male', 'F': 'Femelle'})

In [31]:
df

,identifiant_client,age,sexe,niveau_education,etat_civil,revenu_estime,mois_dans_les_registres,limite_credit,montant_total_des_transactions,nombre_total_des_transactions,desabonnement,année
0,768805383,45,Male,High School,Married,69000,39,12691.0,1144,42,0,2018
1,818770008,49,Femelle,Graduate,Single,24000,44,8256.0,1291,33,0,2018
2,713982108,51,Male,Graduate,Married,93000,36,3418.0,1887,20,0,2018
3,769911858,40,Femelle,High School,Unknown,37000,34,3313.0,1171,20,0,2018
4,709106358,40,Male,Uneducated,Married,65000,21,4716.0,816,28,0,2018
...,...,...,...,...,...,...,...,...,...,...,...,...
81010,788814783,39,Male,Uneducated,Single,60000,22,9204.0,1820,58,0,2022
81011,711711483,61,Male,High School,Married,92000,50,2800.0,1433,40,0,2022
81012,713269533,42,Male,College,Single,118000,36,9959.0,8847,85,1,2022
81013,719070108,44,Male,Graduate,Married,115000,35,34516.0,1729,52,0,2022
81014,758753283,52,Male,Doctorate,Married,121000,45,34516.0,7341,71,1,2022

In [ ]:
Question 6: quelle est le nombre de `Male` et `Femelle` et le pourcentage de chacun.